{
  "data": [
    {
      "title": "thinking....",
      "date": "7/30/21",
      "text": ["thinking........."]
    },
    {
      "title": "Github Pages, Parcel, and React Typescript",
      "date": "11/03/20",
      "text": [
        "First impressions, fantastic! Even if you don’t plan on writing code, going through this material and learning about Machine Learning (ML); is worth it. It gives you an insight into how the magic happens, which boils down to simple mathematics, depending on the model you use. Imagine (1 + 1) just being done 1 million times, somewhere along those lines. But the best part is learning how they are trained. In lesson 1 you will learn how a model is trained like an Image classifier, you build a cat one yourself! You also learn about the many layers in a model and how each layer builds on top of each other. Finally I think the most important takeaway was how to use validation sets and test sets. The insight into testing will not only help you as an individual learning but as an organization as well.",
        "Okay then. Now we can customize our blog. Just for fun let us build this doing React.js and Parcel.js. Now this part is the easy bit, we’ve all done a React App with CRA (create-react-app), which uses webpack to build our app. But we’re experimenting so why not try something new. I decided to use Parcel.js and it was super easy, it can run a dev server for us to work with and do Hot Module Replacement by default.",
        "Just like webpack, parcel will build our files by default in a `dist/` directory. And updates the references in our index.html accordingly. So our css/js files will be located in `dist/main.css and dist/main.js`. But for my case I needed it to build and have everything in the root directory. So my index.html should also reference the css/js files in the same directory.",
        "Again Parcel.js makes it easy by letting us customize the references in our index.html, we just give the build command the arguments `--public-url .` the dot representing the current directory. So I added a couple of scripts to do the following:",
        "Delete `dist` directory and it’s content, Build the project, Delete any files in the root directory from a previous build, Copy new files from `dist` into root directory, Push changes into repo and done!",
        "Final note, you don’t need to do what I did. You can keep the build process as is, but keep in mind your index.html will always need to be in the root folder for github pages to work. So the steps would be as follows:",
        "Build project: `parcel build --public-url <location of css/js files> <location of index file>`, `parcel build --public-url dist src/index.html`, Copy index.html from dist into root, Push changes into git, done!"
      ]
    },
    {
      "title": "Fast.ai Lesson 2",
      "date": "10/28/20",
      "text": [
        "Takeaway: Here we learn more about models, how to augment data to help the model get better. In the case of images we can crop or stretch them and use those images to train the model further. Then we can use our trained model to clean up invalid data, like non-bear images for a bear model (this is a cool test to see how well it’s doing). We also learn a lot about the down sides of ML, like training a model on pictures from the internet is not the same as images from a camera. Making sure you don’t build a biased model that will keep feeding on said biases. We also built a bear model that can tell the difference between 3 types of bears (grizzly, black and teddy).",
        "Downside: Deploying the model online instructions are unclear. Following the instructions and it didn’t really work but I understand the idea behind it so I didn’t care too much."
      ]
    },
    {
      "title": "Fast.ai Lesson 1",
      "date": "10/27/20",
      "text": [
        "First impressions, fantastic! Even if you don’t plan on writing code, going through this material and learning about Machine Learning (ML); is worth it. It gives you an insight into how the magic happens, which boils down to simple mathematics, depending on the model you use. Imagine (1 + 1) just being done 1 million times, somewhere along those lines. But the best part is learning how they are trained. In lesson 1 you will learn how a model is trained like an Image classifier, you build a cat one yourself! You also learn about the many layers in a model and how each layer builds on top of each other. Finally I think the most important takeaway was how to use validation sets and test sets. The insight into testing will not only help you as an individual learning but as an organization as well.",
        "Downside right now? Documentation, but just ever so slightly. Links lead to different pages and content, but I understand this is constantly being updated, so I can’t really hold it against them. Especially if they are giving this away for free."
      ]
    },
    {
      "title": "Why I use Neovim",
      "date": "08/01/20",
      "text": [
        "Well it started out like any “why” starts out. Either to impress someone (married...so nope), boredom (yup this one).",
        "It took a little while to get used to the keys and commands, but honestly you don’t need to know that many. If anything I would recommend making the switch just to show how little you need in terms of what an IDE comes with. What are the essentials?",
        "Copy and Paste, Search and Replace, Code Formatting (I’ll never quit you Prettier!), Git merge conflicts (I still use VSCode for issue)",
        "After reading and watching so many videos on how to customize Neovim to get all the cool features I had on VSCode I learned why VIM came about. The logic of you should only be editing files, was an interesting idea. After having written so many lines of code, I noticed that I tend to edit files more often now then before.",
        "Down side? I end a lot of my emails now with.:w"
      ]
    }
  ]
}
